package com.yuurm;

/**
 * 12.04.2023
 * hw1
 *
 * @author yuurm
 * @version v1.0
 *
 * Данный интерфейс подразумевает возможность сохранять элементы в каком-либо наборе
 * При этом порядок (кого и за кем добавили) элементов не играет роли
 */
public interface Collection<T> {
    /**
     * Добавляет элемент в коллекцию
     * @param element добавляемый элемент
     */
    void add(T element);

    /**
     * Проверяет, есть ли элемент в коллекции
     * @param element искомый элемент
     * @return true, если элемент присутствует хотя бы один раз в коллекции
     */
    boolean contains(T element);

    /**
     * Получаем количество элементов в коллекции
     * @return возвращает число элементов
     */
    int size();

    /**
     * Удаляет первое вхождение элемента в список
     * @param element удаляемый элемент
     */
    void remove(T element);

    Iterator<T> iterator();
}